{
  "architectures": [
    "MoECausalLM"
  ],
  "auto_map": {
    "AutoConfig": "qwen3_moe.Qwen3MoEConfig",
    "AutoModel": "qwen3_moe.Qwen3MoEModel",
    "AutoModelForCausalLM": "qwen3_moe.MoECausalLM"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 9728,
  "max_position_embeddings": 40960,
  "max_window_layers": 36,
  "model_type": "qwen3",
  "moe_layer_indices": [
    34,
    35
  ],
  "num_attention_heads": 32,
  "num_experts_temp": 16,
  "num_hidden_layers": 36,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "router_aux_loss_weight": 0.01,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "top_k": 2,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.52.0",
  "use_cache": false,
  "use_sliding_window": false,
  "vocab_size": 151936
}
